app/Controllers/Contact.php

    public function index()
    {
        $builder = $this->db->table('category');
        $category = $builder->get()->getResult();
---
SELECT *
FROM `category`