app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `article`
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `category`
SELECT *
FROM `article`
 LIMIT 5
---
    public function index()
    {
        $builder = $this->db->table('article');
        $total_article = $builder->countAllResults();

        $builder = $this->db->table('users');
        $total_users = $builder->countAllResults();

        $builder = $this->db->table('category');
        $total_category = $builder->countAllResults();

        $currentPage = $this->request->getVar('page_article') ? $this->request->getVar('page_article') : 1;

        $keyword = $this->request->getVar('q');
        if (isset($keyword)) {
            $search = $this->dashboardModel->search($keyword);
            session()->set('qsearch', $keyword);
        } else {
            $search = $this->dashboardModel;
        }

        $data = [
            'title'             => 'Dashboard',
            'total_article'     => $total_article,
            'total_user'        => $total_users,
            'total_category'    => $total_category,
            'article'           => $search->paginate(5, 'article'),

SELECT *
FROM `category`
---
    public function create_post()
    {
        $builder = $this->db->table('category');
        $category = $builder->get()->getResult();

SELECT `users`.`id` as `userid`, `username`, `email`, `name`
FROM `users`
JOIN `auth_groups_users` ON `auth_groups_users`.`user_id` = `users`.`id`
JOIN `auth_groups` ON `auth_groups`.`id` = `auth_groups_users`.`group_id`
---
    public function user_detail($id = 0)
    {
        $data['title'] = 'User Detail';

        $this->builder->select('users.id as userid, username, email, fullname, user_image, biodata, name');
        $this->builder->join('auth_groups_users', 'auth_groups_users.user_id = users.id');
        $this->builder->join('auth_groups', 'auth_groups.id = auth_groups_users.group_id');