app/Controllers/Lifestyle.php

SELECT *
FROM `category`
SELECT *
FROM `article`
WHERE `category` = 'lifestyle'
ORDER BY `category` ASC
 LIMIT 1, 4
SELECT *
FROM `article`
ORDER BY `id` ASC
 LIMIT 4
SELECT *
FROM `article`
WHERE `category` = 'lifestyle'
ORDER BY `id` ASC
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `article`
WHERE `category` = 'lifestyle'
SELECT *
FROM `article`
ORDER BY `id` ASC
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `article`
---
    public function index()
    {
        $builder = $this->db->table('category');
        $category = $builder->get()->getResult();

        $currentPage = $this->request->getVar('page_article') ? $this->request->getVar('page_article') : 1;

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $search = $this->dashboardModel->search($keyword);
            session()->set('qsearch', $keyword);
            return redirect()->to('/search');
        } else {
            $search = $this->dashboardModel;
        }

        $data = [
            'title'                   => 'Lifestyle',
            'category'                => $category,
            'banner'                  => $search->orderBy('id', 'ASC')->findAll(1),

            'lifestyle'               => $search->orderBy('category', 'ASC')->where(['category' => 'lifestyle'])->findAll(1),
            'article'                 => $search->orderBy('category', 'ASC')->where(['category' => 'lifestyle'])->findAll(4, 1),
            'popular'                 => $search->orderBy('id', 'ASC')->findAll(4),
            'recent'                  => $search->orderBy('id', 'RANDOM')->findAll(4),

            'latest_post'             => $search->orderBy('id', 'ASC')->where(['category' => 'lifestyle'])->paginate(5, 'article'),
            'celebration'             => $search->orderBy('id', 'ASC')->paginate(2, 'article'),